# Taps
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/core"

# Common dependencies
brew "jq"
brew "sqlite"
brew "tree"

# Languages
brew "nvm"
brew "python", link: true
brew "go"

# Devops
cask "google-cloud-sdk"
cask "awscli"
brew "azure-cli"

# Development Tools
cask "font-fira-code"
cask "sublime-text"
cask "visual-studio-code"
cask "beekeeper-studio"
cask "docker"
cask "insomnia"

# Productivity
cask "1Password"
cask "1Password-cli"
cask "karabiner-elements"
cask "slack"
cask "rectangle"

# Data Science
brew "jupyterlab"

# Misc
cask "sonos"
cask "spotify"
