# Taps
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/core"

# Common dependencies
brew "jq"
brew "sqlite"
brew "tree"
brew "gpg"

# Languages
brew "nvm", link: true
brew "python", link: true
brew "go"

# Devops
cask "google-cloud-sdk"
brew "awscli"
brew "azure-cli"
brew "kubectl"


# Development Tools
cask "font-fira-code"
cask "sublime-text"
cask "visual-studio-code"
cask "beekeeper-studio"
cask "docker"
cask "insomnia"
cask "iterm2"

# Productivity
cask "google-chrome"
cask "1Password"
cask "1Password-cli"
cask "slack"
cask "rectangle"

# Data Science
brew "jupyterlab"

# Misc
cask "sonos"
cask "spotify"
