# Taps
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/core"

# Common dependencies
brew "jq"
brew "node"
brew "python", link: true
brew "sqlite"
brew "tree"

# Development Tools
cask "balenaetcher"
cask "docker"
cask "github"
cask "mcgimp"
cask "hyper"
cask "postman"

# Editors/IDEs
cask "font-fira-code"
cask "sublime-text"
cask "visual-studio-code"

# Productivity
cask "1Password"
cask "1Password-cli"
cask "discord"
cask "gpg-suite"
cask "keybase"

#cask "karabiner-elements"
cask "rectangle"
cask "signal"
x#cask "slack"
cask "spotify"

# Data Science
brew "jupyter"

# Misc
cask "sonos"
